# Uso de Dataframe en Pandas
##### https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html

In [2]:
import pandas as pd
import sys
import datetime as dt
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
from pandas.tools.plotting import radviz

%matplotlib inline

In [3]:
mi_df = pd.DataFrame(({'a': [11,12,13], 'b': [21,22,23]}))
print mi_df

SyntaxError: Missing parentheses in call to 'print' (<ipython-input-3-0e3e616dbaba>, line 2)

In [4]:
data = {'ciudad': ['Loja', 'Pichincha', 'Guayas'],
        'capital' : ['Loja', 'Quito', 'Guayaquil'],
        'zona'  : [7, 8, 1]}
frame = pd.DataFrame(data) # Creando un DataFrame desde un diccionario
frame

     capital     ciudad  zona
0       Loja       Loja     7
1      Quito  Pichincha     8
2  Guayaquil     Guayas     1

In [5]:
columnas = ['nombres','apellidos','cedula']

In [6]:
lista = [['rene', 'elizalde', '11041260'],
        ['rolando', 'solano', '11041261'],]

In [7]:
data = pd.DataFrame(lista, columns=columnas)

In [8]:
data

   nombres apellidos    cedula
0     rene  elizalde  11041260
1  rolando    solano  11041261

In [9]:
lista2 = [['rene2', 'elizalde2', '11041263'],
        ['rolando2', 'solano2', '11041264'],]

In [10]:
data2 = pd.DataFrame(lista2, columns=columnas)

In [11]:
data2

    nombres  apellidos    cedula
0     rene2  elizalde2  11041263
1  rolando2    solano2  11041264

In [12]:
data3 = pd.concat([data, data2])

In [13]:
data3

    nombres  apellidos    cedula
0      rene   elizalde  11041260
1   rolando     solano  11041261
0     rene2  elizalde2  11041263
1  rolando2    solano2  11041264

In [25]:
data5 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263', '11041264'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito', 'Loja'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha', 'Loja']})

In [26]:
data5

      Ciudad  Provincia    cedula
0  Guayaquil     Guayas  11041260
1     Cuenca      Azuay  11041261
2      Quito  Pichincha  11041263
3       Loja       Loja  11041264

In [27]:
result = pd.merge(data3, data5, on='cedula')

In [28]:
result.keys()

Index(['nombres', 'apellidos', 'cedula', 'Ciudad', 'Provincia'], dtype='object')

In [18]:
data6 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha']})
data6

      Ciudad  Provincia    cedula
0  Guayaquil     Guayas  11041260
1     Cuenca      Azuay  11041261
2      Quito  Pichincha  11041263